app/controllers/blogs_controller.rb

INSERT INTO "blogs" ("title", "category", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Hopeful lessons from the battle to save rainforests"], ["category", "Nature"], ["body", ""], ["created_at", "2020-04-25 11:44:08.139162"], ["updated_at", "2020-04-25 11:44:08.139162"]]
---
  def create
    blog = Blog.new(blog_params)
    blog.save

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "blogs" SET "body" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["body", "編集済み"], ["updated_at", "2020-04-25 12:15:16.484857"], ["id", 1]]
---
  def update
    blog = Blog.find(params[:id])
    blog.update(blog_params)

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "blogs" WHERE "blogs"."id" = ?  [["id", 1]]
---
  def destroy
    blog = Blog.find(params[:id])
    blog.destroy